In [1]:
import numpy as np
import pandas as pd

In [3]:
sr = pd.Series([1.2, 1.5, 2.4, 2.8, np.nan, 3.5, 4.1, 9.0])

print(sr.max(), sr.min())
print(sr.mean(), sr.std())

9.0 1.2
3.5 2.6331223544175333

In [4]:
delta = 2
bottom = sr.mean() - delta * sr.std()
top = sr.mean() + sr.std()

print(bottom)
print(top)

-1.7662447088350666
6.133122354417534

In [5]:
print('outlier:')

for val in sr:
    if val < bottom:
        print(val)
    elif val > top:
        print(val)

outlier:
9.0

# # NaN은 다루 수와의 연산 결과도 NaN, 비교연산은 !=을 제외하고 False

In [6]:
np.nan > 10

False

In [7]:
10 != np.nan

True

In [ ]:
# df.info()
# df.columns
# df.dtype
# de.describe()

In [ ]:
# IQR법을 해서 이상치 판단하는 거 해보기

In [8]:
df = pd.DataFrame({'c1': ['a', 'a', 'b', 'a', 'b'],
                  'c2': [1, 1, 1, 2, 2],
                  'c3': [1, 1, 2, 2, 2]})
df

  c1  c2  c3
0  a   1   1
1  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [9]:
df_dup = df.duplicated()
df_dup

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [12]:
df.duplicated(keep = 'first')

0    False
1     True
2    False
3    False
4    False
dtype: bool

In [14]:
df.duplicated(keep = False)

0     True
1     True
2    False
3    False
4    False
dtype: bool

In [10]:
df_clean = df.drop_duplicates()
df_clean

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2
4  b   2   2

In [11]:
df2 = df.drop_duplicates(subset = ['c2', 'c3'])
df2

  c1  c2  c3
0  a   1   1
2  b   1   2
3  a   2   2